app/controllers/bike_trails_controller.rb

    def index
        bike_trails = BikeTrail.all
---
SELECT "bike_trails".* FROM "bike_trails"

    def show
        bike_trail = BikeTrail.find(params[:id])
---
SELECT "bike_trails".* FROM "bike_trails" WHERE "bike_trails"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]