app/controllers/counters_controller.rb

SELECT "counters".* FROM "counters" WHERE "counters"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def show
        counter = Counter.find(params[:id])